{"class_name": "Sequential", "sample_weight_mode": null, "optimizer": {"name": "RMSprop", "lr": 0.0010000000474974513, "rho": 0.8999999761581421, "epsilon": 1e-08}, "keras_version": "1.0.6", "loss": "sparse_categorical_crossentropy", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "batch_input_shape": [null, 10], "trainable": false, "init": "uniform", "input_dim": 52, "W_regularizer": null, "input_dtype": "int32", "input_length": 10, "mask_zero": false, "name": "embedding_1", "activity_regularizer": null, "output_dim": 52, "dropout": 0.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "bias": true, "batch_input_shape": [null, 520], "trainable": true, "init": "uniform", "activation": "linear", "input_dim": 520, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "name": "dense_1", "activity_regularizer": null, "output_dim": 512}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-06, "axis": -1, "name": "batchnormalization_1", "momentum": 0.9, "trainable": true, "mode": 0}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "bias": true, "batch_input_shape": [null, 520], "trainable": true, "init": "uniform", "activation": "linear", "input_dim": 520, "b_regularizer": null, "W_regularizer": null, "input_dtype": "float32", "name": "dense_2", "activity_regularizer": null, "output_dim": 512}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-06, "axis": -1, "name": "batchnormalization_2", "momentum": 0.9, "trainable": true, "mode": 0}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"b_constraint": null, "W_constraint": null, "bias": true, "trainable": true, "init": "glorot_uniform", "activation": "linear", "input_dim": null, "name": "dense_3", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "output_dim": 52}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}}]}