{"keras_version": "1.0.6", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam", "clipvalue": 1.0}, "loss": "sparse_categorical_crossentropy", "config": [{"class_name": "Merge", "config": {"mode": "concat", "concat_axis": -1, "output_shape_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 52, "trainable": false, "input_dim": 52, "init": "uniform", "W_regularizer": null, "input_length": 1, "name": "embedding_97", "input_dtype": "int32", "dropout": 0.0, "mask_zero": true, "batch_input_shape": [1, 1], "activity_regularizer": null}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"W_constraint": null, "output_dim": 2, "trainable": true, "input_dim": 119, "init": "uniform", "W_regularizer": null, "input_length": 1, "name": "embedding_98", "input_dtype": "int32", "dropout": 0.0, "mask_zero": true, "batch_input_shape": [1, 1], "activity_regularizer": null}}]}], "mode_type": "raw", "dot_axes": [-1, -1], "name": "merge_46", "output_shape": null}}, {"class_name": "GRU", "config": {"U_regularizer": null, "output_dim": 256, "unroll": false, "trainable": true, "consume_less": "cpu", "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [1, 1, 54], "name": "gru_89", "input_dtype": "float32", "inner_activation": "hard_sigmoid", "activation": "tanh", "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "go_backwards": false, "stateful": true, "return_sequences": true, "dropout_U": 0.0}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_87", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_83", "p": 0.2, "trainable": true}}, {"class_name": "GRU", "config": {"U_regularizer": null, "output_dim": 256, "unroll": false, "trainable": true, "consume_less": "cpu", "b_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [1, 1, 256], "name": "gru_90", "input_dtype": "float32", "inner_activation": "hard_sigmoid", "activation": "tanh", "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "go_backwards": false, "stateful": true, "return_sequences": true, "dropout_U": 0.0}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_88", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_84", "p": 0.2, "trainable": true}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"bias": true, "W_constraint": null, "output_dim": 52, "trainable": true, "input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_44", "b_constraint": null, "activation": "softmax", "activity_regularizer": null}}, "name": "timedistributed_44", "trainable": true}}], "sample_weight_mode": null, "class_name": "Sequential"}