{"loss": "sparse_categorical_crossentropy", "sample_weight_mode": null, "config": [{"class_name": "Embedding", "config": {"input_dim": 52, "activity_regularizer": null, "input_length": 1, "W_constraint": null, "init": "uniform", "batch_input_shape": [1, 1], "W_regularizer": null, "mask_zero": true, "trainable": true, "output_dim": 52, "name": "embedding_2", "dropout": 0.0, "input_dtype": "int32"}}, {"class_name": "GRU", "config": {"inner_activation": "hard_sigmoid", "b_regularizer": null, "unroll": false, "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "init": "glorot_uniform", "U_regularizer": null, "batch_input_shape": [1, 1, 52], "W_regularizer": null, "dropout_U": 0.0, "stateful": true, "consume_less": "cpu", "activation": "tanh", "trainable": true, "output_dim": 512, "input_dtype": "float32", "return_sequences": true, "name": "gru_3"}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_3", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_3"}}, {"class_name": "GRU", "config": {"inner_activation": "hard_sigmoid", "b_regularizer": null, "unroll": false, "dropout_W": 0.0, "inner_init": "orthogonal", "go_backwards": false, "init": "glorot_uniform", "U_regularizer": null, "batch_input_shape": [1, 1, 512], "W_regularizer": null, "dropout_U": 0.0, "stateful": true, "consume_less": "cpu", "activation": "tanh", "trainable": true, "output_dim": 512, "input_dtype": "float32", "return_sequences": true, "name": "gru_4"}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_4"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activation": "softmax", "W_regularizer": null, "b_constraint": null, "trainable": true, "output_dim": 52, "name": "dense_2"}}, "name": "timedistributed_2"}}], "class_name": "Sequential", "keras_version": "1.0.6", "optimizer": {"epsilon": 1e-08, "lr": 0.009999999776482582, "name": "Adagrad"}}